raw_questions: list[dict] = [

    # Text Mode
    {
        "type": "text",
        "hint": "คนที่แสดงอาการตื่นตกใจง่าย โดยที่ยังไม่ได้ตรวจสอบหาข้อเท็จจริงให้แน่ชัดก่อน",
        "answer": "กระต่ายตื่นตูม",
        "blank": "กระ...ตื่น...",
        "choices": ["หมาย", "เดียว", "ต่าย", "ขา", "นอน", "ตูม"]
    },
    {
        "type": "text",
        "hint": "หญิงค่อนข้างมีอายุที่มีเล่ห์เหลี่ยมมารยามาก และมีกิริยาจัดจ้านรุนแรง",
        "answer": "กระต่ายแก่แม่ปลาช่อน",
        "blank": "กระต่าย...แม่...ช่อน",
        "choices": ["ขาว", "แก่", "ฟู", "ปลา", "ลา", "เด็ก"]
    },
    {
        "type": "text",
        "hint": "การที่ได้สิ่งที่มีค่ามาครอบครอง แต่กลับไม่รู้คุณค่าของสิ่งนั้น",
        "answer": "ไก่ได้พลอย",
        "blank": "...ได้...",
        "choices": ["กบ", "ไก่", "เพชร", "ดิน", "คน", "พลอย"]
    },
    {
        "type": "text",
        "hint": "คนหรือสิ่งของที่อยู่ในฐานะตัวสำรอง ซึ่งจะถูกเรียกใช้เมื่อใดก็ได้",
        "answer": "ไก่รองบ่อน",
        "blank": "...รอง...",
        "choices": ["ไก่", "วัว", "บอน", "บ่อน", "ปอน", "กา"]
    },
    {
        "type": "text",
        "hint": "คนที่มีสันดานคดโกง ไม่ซื่อสัตย์",
        "answer": "คดในข้อง้อในกระดูก",
        "blank": "...ใน...ง้อใน...",
        "choices": ["กระดูก", "คน", "กระต่าย", "คด", "ไข่", "ข้อ"]
    },

    # Choice Mode 1-4
    {
        "type": "choice",
        "hint": "คนรักเรามีน้อย แต่คนเกลียดชังเรามีมากกว่า",
        "answer": "คนรักเท่าผืนหนังคนชังเท่าผืนเสื่อ",
        "choices": [
            "คนรักเท่าผืนหนังคนชังเท่าผืนเสื่อ", # ข้อถูก
            "ขิงก็ราข่าก็แรง",
            "หน้าเนื้อใจเสือ",
            "ปากปราศรัยน้ำใจเชือดคอ"
        ]
    },
    {
        "type": "choice",
        "hint": "การกระทำสิ่งที่เสี่ยงอันตรายอย่างมาก",
        "answer": "จับงูข้างหาง",
        "choices": [
            "เอามือซุกหีบ",
            "จับงูข้างหาง", # ข้อถูก
            "ขี่ช้างจับตั๊กแตน",
            "จับปลาสองมือ"
        ]
    },
    {
        "type": "choice",
        "hint": "การปล่อยให้เป็นไปตามเรื่องตามราว ปล่อยวางไม่เข้าไปยุ่งเกี่ยวข้อง",
        "answer": "ชั่วช่างชีดีช่างสงฆ์",
        "choices": [
            "เข้าตาจน",
            "ปล่อยนกปล่อยปลา",
            "ชั่วช่างชีดีช่างสงฆ์", # ข้อถูก
            "ตัดหางปล่อยวัด"
        ]
    },
    {
        "type": "choice",
        "hint": "สามีภรรยาที่ช่วยกันทำมาหากิน สร้างเนื้อสร้างตัว",
        "answer": "ชายหาบหญิงคอน",
        "choices": [
            "กิ่งทองใบหยก",
            "ผัวคอนเมียหาบ",
            "คู่สร้างคู่สม",
            "ชายหาบหญิงคอน" # ข้อถูก
        ]
    },
    {
        "type": "choice",
        "hint": "การทำงานอย่างรอบคอบ ค่อยๆ คิด ค่อยๆ ทำ แล้วงานจะสำเร็จลุล่วงด้วยดีและมีคุณภาพ",
        "answer": "ช้าๆได้พร้าสองเล่มงาม",
        "choices": [
            "ช้าๆได้พร้าสองเล่มงาม", # ข้อถูก
            "น้ำซึมบ่อทราย",
            "ฝนทั่งให้เป็นเข็ม",
            "ช้าเป็นการนานเป็นคุณ"
        ]
    }
]